{
  "intro_1": "My name is Daniel Márquez. I started by running Moodle campuses and automating their workflows, which pushed me to build custom solutions on top of Odoo.",
  "intro_1_5": "Today Odoo remains my core, but I pair it with FastAPI services, Astro + Preact frontends, and data pipelines whenever a project needs more than ERP.",
  "intro_2": "I recently delivered OpositaTCAE end-to-end: streaming-ready frontend in Astro/Preact, FastAPI backend packaged with Docker, and AWS infrastructure (EC2, S3, CloudFront signed cookies) to protect premium content.",
  "intro_3": "Right now I am doubling down on cloud automation with Docker and Terraform, exploring Kubernetes for upcoming workloads,",
  "intro_3_1": "and using CI/CD to ship analytics services in Python (Pandas) and PostgreSQL.",
  "intro_3_2": "This mix lets me evolve legacy platforms into modern, observable products.",
  "date_saec_data": "At the moment...",
  "date_freelance": "At the moment...",
  "title_saec_data": "Software Developer",
  "company_saec_data": "Saec Data",
  "description_saec_data": "Development and configuration of Odoo modules using Python, PostgreSQL, XML and JavaScript. I also work on generating reports and invoices with Jasper Reports.",
  "title_freelance": "Software Developer",
  "company_freelance": "Freelance",
  "description_freelance": "I design and operate end-to-end learning platforms. Highlights: OpositaTCAE (Astro + Preact frontend, FastAPI backend on Docker, AWS CloudFront signed cookies safeguarding the video streaming) and Odoo customisations backed by PostgreSQL analytics.",
  "title_big_formacion": "ICT Consultant",
  "company_big_formacion": "BiG Formación",
  "description_big_formacion": "Managed Moodle and custom video streaming products, containerising services with Docker and orchestrating deployments on AWS (EC2, S3, CloudFront) while improving observability.",
  "more_info_saec_data": "More info",
  "more_info_freelance": "More info",
  "more_info_big_formacion": "More info",
  "about_me": "About me",
  "contacto": "Contact",
  "experiencia": "Experience",
  "experiencia_label": "experience",
  "experiencia_url": "/#experience",
  "proyectos": "Projects",
  "proyectos_label": "projects",
  "proyectos_url": "/#projects",
  "proyectos_trabajo": "Work Projects",
  "proyectos_trabajo_label": "workprojects",
  "proyectos_trabajo_url": "/#workprojects",
  "about_me_label": "about-me",
  "about_me_url": "/#about-me",
  "contacto_label": "contact",
  "disponible_trabajar": "Available to work",
  "hola": "Hey, I'm DaniMarqz",
  "web_developer": "Full-stack Developer & DevOps",
  "from": "from Ourense, Spain. Web developer specializing in Odoo, FastAPI, Astro + Preact, and cloud infrastructure.",
  "contact_me": "Contact me",
  "mytasks_description": "Application to save tasks, with login and crud to an encrypted postgres database.",
  "amazon_description": "Amazon Clone using Asp.Net Core MVC and Razor Pages. Customer profile can only purchase and review their cart and purchase history. Admin can create/modify/delete products and review all transaction and cart history. Microsoft SQL Server Database.",
  "codigo": "Code",
  "previsualizar": "Preview",
  "turismovalencia_title": "Valencia Tourism - Customized Moodle Platform",
  "turismovalencia_desc": "Moodle-based tourism campus hosted on AWS with custom branding, on-demand video content, and automated deployments.",
  "crou_titulo": "CROU - Customized Moodle Platform",
  "crou_desc": "Province-wide Moodle campus with whitelabel mobile apps, AWS infrastructure, and streaming content delivered through signed links.",
  "elige_tema": "Choose theme",
  "experiencia_laboral": "Work experience",
  "trabajos": "Jobs",
  "proyectos_personales": "Personal Projects",
  "titulo_web": "DaniMarqz's Portfolio - Web Developer and Programmer",
  "descripcion_web": "Hire DaniMarqz to create your web or mobile application. Web developer with extensive experience in databases.",
  "opositatcae_title": "OpositaTCAE",
  "opositatcae_desc": "End-to-end platform: Astro + Preact storefront, FastAPI microservices in Docker, PostgreSQL, and AWS (EC2, S3, CloudFront signed cookies) securing video streaming and the exam simulator.",
  "ecommerce": "Secure API hardened on Cloudflare Workers with TypeScript, signed cookies, and Docker-based CI pipelines ready for AWS deployment.",
  "mytasks": "Application for saving notes, with login and CRUD operations connected to an encrypted PostgreSQL database.",
  "flutter": "Mobile application using Flutter to save notes, track books read, and manage expenses and investments, with login and CRUD operations connected to Supabase.",
  "more_info": "More info",
  "elige_idioma": "Change language",
  "current_language": "🇺🇸",
  "descripcion_big": "I manage and evolve Moodle platforms and custom streaming apps, layering FastAPI services, PostgreSQL analytics, and Dockerised deployments on AWS.",
  "oposita_simulator": "Source for the OpositaTCAE simulator: Astro + Preact frontend, FastAPI backend in Docker, Pandas scoring pipelines on PostgreSQL, deployed on AWS with signed cookies protecting premium content.",
  "quizreport": "Moodle plugin that orchestrates FastAPI services via webhooks to stream quiz data and launch Pandas dashboards in real time.",
  "quiz_analysis": "FastAPI and Pandas service crunching Moodle quiz attempts in real time, persisting aggregates on PostgreSQL inside Dockerized workloads.",
  "quiz_percentile": "Analytics module that exposes percentile insights from PostgreSQL through FastAPI endpoints and renders custom charts for learners.",
  "date_big_formacion": "08/2020 - 09/2024"
}