{
  "intro_1": "Me llamo Daniel M치rquez. Empec칠 gestionando campus Moodle y automatizando sus tareas, lo que me llev칩 a construir soluciones a medida sobre Odoo.",
  "intro_1_5": "Hoy Odoo sigue siendo mi n칰cleo, pero lo combino con servicios FastAPI, frontends Astro + Preact y pipelines de datos cuando un proyecto necesita algo m치s que un ERP.",
  "intro_2": "Hace poco entregu칠 OpositaTCAE de extremo a extremo: frontend preparado para streaming con Astro/Preact, backend FastAPI contenerizado con Docker e infraestructura en AWS (EC2, S3, CloudFront con cookies firmadas) para proteger el contenido premium.",
  "intro_3": "Ahora profundizo en cloud y automatizaci칩n con Docker y Terraform, explorando Kubernetes para las pr칩ximas cargas,",
  "intro_3_1": "adem치s de usar CI/CD para desplegar servicios de anal칤tica en Python (Pandas) y PostgreSQL.",
  "intro_3_2": "As칤 convierto plataformas heredadas en productos modernos y observables.",
  "date_saec_data": "Actualmente...",
  "date_freelance": "Actualmente...",
  "date_big_formacion": "08/2020 - 09/2024",
  "title_saec_data": "Software Developer",
  "company_saec_data": "Saec Data",
  "description_saec_data": "Desarrollo y configuraci칩n de m칩dulos de Odoo usando Python, PostgreSQL, XML y JavaScript. Tambi칠n trabajo en la generaci칩n de informes y facturas con Jasper Reports.",
  "title_freelance": "Consultor Moodle",
  "company_freelance": "Freelance",
  "description_freelance": "Dise침o y opero plataformas de formaci칩n de extremo a extremo. Destaca OpositaTCAE (frontend Astro + Preact, backend FastAPI sobre Docker, AWS CloudFront con cookies firmadas para proteger el streaming) y personalizaciones de Odoo respaldadas por anal칤tica en PostgreSQL.",
  "title_big_formacion": "Consultor TIC",
  "company_big_formacion": "BiG Formaci칩n",
  "description_big_formacion": "Gestion칠 plataformas Moodle y productos de streaming propios, contenerizando servicios con Docker y orquestando despliegues en AWS (EC2, S3, CloudFront) mientras mejoraba la observabilidad.",
  "more_info_saec_data": "Saber m치s",
  "more_info_freelance": "Saber m치s",
  "more_info_big_formacion": "Saber m치s",
  "about_me": "Sobre m칤",
  "contacto": "Contacto",
  "experiencia": "Experiencia",
  "experiencia_label": "experiencia",
  "experiencia_url": "/#experiencia",
  "proyectos": "Proyectos",
  "proyectos_label": "proyectos",
  "proyectos_url": "/#proyectos",
  "proyectos_trabajo": "Proyectos Trabajo",
  "proyectos_trabajo_label": "proyectostrabajo",
  "proyectos_trabajo_url": "/#proyectostrabajo",
  "about_me_label": "sobre-mi",
  "about_me_url": "/#sobre-mi",
  "contacto_label": "contacto",
  "disponible_trabajar": "Disponible para trabajar",
  "hola": "Hey, soy DaniMarqz",
  "web_developer": "Ingeniero Full-stack & DevOps",
  "from": "de Ourense, Espa침a. Desarrollador web especializado en Odoo, FastAPI, Astro + Preact e infraestructura cloud.",
  "contact_me": "Cont치ctame",
  "mytasks_description": "Aplicaci칩n para guardar notas, con login y crud hacia una base de datos postgres encriptada.",
  "amazon_description": "Amazon Clone usando Asp.Net Core MVC y Razor Pages. El perfil cliente s칩lo puede comprar y revisar su carrito y registro de compras. El admin puede crear/modificar/eliminar los productos y revisar todo el historial de transacciones y carritos. Base de Datos Microsoft SQL Server.",
  "codigo": "C칩digo",
  "previsualizar": "Previsualizar",
  "turismovalencia_title": "Turismo Valencia - Plataforma Moodle Customizada",
  "turismovalencia_desc": "Campus tur칤stico sobre Moodle alojado en AWS con branding a medida, v칤deo bajo demanda y despliegues automatizados.",
  "crou_titulo": "CROU - Plataforma Moodle Customizada",
  "crou_desc": "Campus Moodle provincial con apps m칩viles whitelabel, infraestructura en AWS y streaming servido mediante enlaces firmados.",
  "elige_tema": "Elige el tema",
  "experiencia_laboral": "Experiencia laboral",
  "trabajos": "Trabajos",
  "proyectos_personales": "Proyectos Personales",
  "titulo_web": "Porfolio de DaniMarqz - Desarrollador y Programador Web",
  "descripcion_web": "Contrata a DaniMarqz para crear tu aplicaci칩n web o m칩vil. Desarrollador Web con amplia experiencia en bases de datos.",
  "opositatcae_title": "OpositaTCAE",
  "opositatcae_desc": "Plataforma integral: frontend Astro + Preact, microservicios FastAPI en Docker, PostgreSQL y AWS (EC2, S3, CloudFront con cookies firmadas) para asegurar el streaming de v칤deo y el simulador.",
  "ecommerce": "API segura en Cloudflare Workers con TypeScript, cookies firmadas y pipelines Docker listas para desplegar en AWS.",
  "mytasks": "Aplicaci칩n para guardar notas, con login y crud hacia una base de datos postgres encriptada.",
  "flutter": "Aplicaci칩n m칩vil usando Flutter para guardar notas, libros le칤dos, gesti칩n de gastos e inversiones con login y crud hacia supabase.",
  "more_info": "Saber m치s",
  "elige_idioma": "Cambiar idioma",
  "current_language": "游쀯릖",
  "descripcion_big": "Gestiono y evoluciono plataformas Moodle y aplicaciones de streaming, incorporando servicios FastAPI, anal칤tica en PostgreSQL y despliegues contenerizados en AWS.",
  "oposita_simulator": "C칩digo del simulador de OpositaTCAE: frontend Astro + Preact, backend FastAPI en Docker, pipelines de correcci칩n con Pandas sobre PostgreSQL y despliegue en AWS con cookies firmadas que protegen el contenido premium.",
  "quizreport": "Plugin de Moodle que orquesta servicios FastAPI mediante webhooks para emitir datos de cuestionarios y lanzar paneles con Pandas en tiempo real.",
  "quiz_analysis": "Servicio FastAPI + Pandas que procesa intentos de cuestionarios en tiempo real, guardando agregados en PostgreSQL dentro de contenedores Docker.",
  "quiz_percentile": "M칩dulo de anal칤tica que expone percentiles desde PostgreSQL v칤a endpoints FastAPI y renderiza gr치ficos personalizados para el alumnado."
}
